levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_adc.c
/**
 *******************************************************************************
 * @file  hc32m423_adc.c
 * @brief This file provides firmware functions to manage the Analog-to-Digital
 *        Converter(ADC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-03       Wuze            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_adc.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_ADC ADC
 * @brief Analog-to-Digital Converter Driver Library
 * @{
 */

#if (DDL_ADC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ADC_Local_Macros ADC Local Macros
 * @{
 */
/**
 * @defgroup ADC_Configuration_Bit_Mask ADC Configuration Bit Mask
 * @{
 */
#define ADC_TRIG_SRC_MSK                    (ADC_TRGSR_TRGSELA)
#define ADC_EOC_FLAG_MSK                    (ADC_FLAG_EOCA | ADC_FLAG_EOCB)
#define ADC_SH_CFG_MSK                      (ADC_SHCR_SHT | ADC_SHCR_SHSEL)
/**
 * @}
 */

/**
 * @defgroup ADC_Trigger_Event_Register
 * @{
 */
#define ADC_TRG_EVT0_REG                    (M4_AOS->ADC_ITRGSELR0)
#define ADC_TRG_EVT1_REG                    (M4_AOS->ADC_ITRGSELR1)
/**
 * @}
 */

/**
 * @defgroup ADC_Register_Bit_Band ADC Register Bit Band
 * @{
 */
#define __PERIP_BASE                        (0x40000000UL)
#define __REG_OFS(__reg__)                  ((uint32_t)&(__reg__) - __PERIP_BASE)
#define __BIT_BAND_ADDR(__reg__, __pos__)   ((__REG_OFS(__reg__) << 5U) + ((uint32_t)(__pos__) << 2UL))
#define BIT_BAND(__reg__, __pos__)          (*(__IO uint32_t *)__BIT_BAND_ADDR(__reg__, __pos__))
/**
 * @}
 */

/**
 * @defgroup ADC_Check_Parameters_Validity ADC check parameters validity
 * @{
 */
#define IS_ADC_SCAN_MODE(x)                                                    \
(   ((x) == ADC_MODE_SA_SSHOT)              ||                                 \
    ((x) == ADC_MODE_SA_CONT)               ||                                 \
    ((x) == ADC_MODE_SA_SB_SSHOT)           ||                                 \
    ((x) == ADC_MODE_SA_CONT_SB_SSHOT))

#define IS_ADC_RESOLUTION(x)                                                   \
(   ((x) == ADC_RES_8BIT)                   ||                                 \
    ((x) == ADC_RES_10BIT)                  ||                                 \
    ((x) == ADC_RES_12BIT))

#define IS_ADC_AUTO_CLEAR_CMD(x)                                               \
(   ((x) == ADC_AUTO_CLR_DISABLE)           ||                                 \
    ((x) == ADC_AUTO_CLR_ENABLE))

#define IS_ADC_DATA_ALIGN(x)                                                   \
(   ((x) == ADC_DATA_ALIGN_RIGHT)           ||                                 \
    ((x) == ADC_DATA_ALIGN_LEFT))

#define IS_ADC_SA_RESTRT_POS(x)                                                \
(   ((x) == ADC_SA_RESTRT_POS_INT_CH)       ||                                 \
    ((x) == ADC_SA_RESTRT_POS_FIRST_CH))

#define IS_ADC_PIN_NUMBER(x)                                                   \
(   ((x) <= ADC_ANI9))

#define IS_ADC_SEQUENCE(x)                                                     \
(   ((x) == ADC_SEQ_A)                      ||                                 \
    ((x) == ADC_SEQ_B))

#define IS_ADC_SPL_TIME(x)                                                     \
(   ((x) >= 5U) && ((x) <= 255U))

#define IS_ADC_AVG_CNT(x)                                                      \
(   ((x) == ADC_AVG_CNT_2)                  ||                                 \
    ((x) == ADC_AVG_CNT_4)                  ||                                 \
    ((x) == ADC_AVG_CNT_8)                  ||                                 \
    ((x) == ADC_AVG_CNT_16)                 ||                                 \
    ((x) == ADC_AVG_CNT_32)                 ||                                 \
    ((x) == ADC_AVG_CNT_64)                 ||                                 \
    ((x) == ADC_AVG_CNT_128)                ||                                 \
    ((x) == ADC_AVG_CNT_256))

#define IS_ADC_TRIG_SRC(x)                                                     \
(   ((x) == ADC_TRIG_SRC_ADTRG)             ||                                 \
    ((x) == ADC_TRIG_SRC_EVT0)              ||                                 \
    ((x) == ADC_TRIG_SRC_EVT1)              ||                                 \
    ((x) == ADC_TRIG_SRC_EVT0_EVT1))

#define IS_ADC_EXCH_SRC(x)                                                     \
(   ((x) == ADC_EXCH_SRC_ADC_PIN)           ||                                 \
    ((x) == ADC_EXCH_SRC_INTERNAL))

#define IS_ADC_SH_CH(x)                                                        \
(   ((x) <= (ADC_CH0 | ADC_CH1 | ADC_CH2)))

#define IS_ADC_SH_CYCLE(x)                                                     \
(   ((x) >= 4U) && ((x) <= 255U))

/**
 * @}
 */

/**
 * @}
 */

