levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_adc.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup ADC_Global_Functions ADC Global Functions
 * @{
 */

/**
 * @brief  Initializes the ADC peripheral according to the specified parameters
 *         in the structure stc_adc_init.
 * @param  [in]  pstcInit           Pointer to a stc_adc_init_t structure value that
 *                                  contains the configuration information for the ADC.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcInit == NULL.
 */
en_result_t ADC_Init(const stc_adc_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        DDL_ASSERT(IS_ADC_SCAN_MODE(pstcInit->u16ScanMode));
        DDL_ASSERT(IS_ADC_RESOLUTION(pstcInit->u16Resolution));
        DDL_ASSERT(IS_ADC_AUTO_CLEAR_CMD(pstcInit->u16AutoClrCmd));
        DDL_ASSERT(IS_ADC_DATA_ALIGN(pstcInit->u16DataAlign));
        DDL_ASSERT(IS_ADC_SA_RESTRT_POS(pstcInit->u16SARestrtPos));

        /* Configures scan convert mode, resolution, data automatically cleared cmd
           and data alignment. */
        M4_ADC->CR0 = pstcInit->u16ScanMode   | \
                      pstcInit->u16Resolution | \
                      pstcInit->u16AutoClrCmd | \
                      pstcInit->u16DataAlign;

        /* Configures the channel sequence A restart from. */
        M4_ADC->CR1  = pstcInit->u16SARestrtPos;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initializes the ADC peripheral.
 * @param  None
 * @retval None
 */
void ADC_DeInit(void)
{
    uint8_t i;
    __IO uint8_t *ioSSTR;

    /* Stop the ADC. */
    ADC_Stop();

    /* Set the registers to reset value. */
    M4_ADC->CR0       = 0x0U;
    M4_ADC->CR1       = 0x0U;
    M4_ADC->TRGSR     = 0x0U;
    M4_ADC->CHSELRA0  = 0x0U;
    M4_ADC->CHSELRB0  = 0x0U;
    M4_ADC->AVCHSELR0 = 0x0U;
    M4_ADC->EXCHSELR  = 0x0U;
    M4_ADC->SHCR      = 0x0U;
    M4_ADC->ICR       = 0x0U;

    ioSSTR = (__IO uint8_t *)((uint32_t)&M4_ADC->SSTR0);
    for (i=0; i<ADC_CH_CNT; i++)
    {
        ioSSTR[i] = (uint8_t)0x0BU;
    }
}

/**
 * @brief  Set a default value for the ADC initialization structure.
 * @param  [in]  pstcInit           Pointer to a stc_adc_init_t structure that
 *                                  contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcInit == NULL.
 */
en_result_t ADC_StructInit(stc_adc_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        pstcInit->u16ScanMode    = ADC_MODE_SA_SSHOT;
        pstcInit->u16Resolution  = ADC_RES_12BIT;
        pstcInit->u16AutoClrCmd  = ADC_AUTO_CLR_DISABLE;
        pstcInit->u16DataAlign   = ADC_DATA_ALIGN_RIGHT;
        pstcInit->u16SARestrtPos = ADC_SA_RESTRT_POS_INT_CH;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  
 * @param  [in]  
 * @param  [out] 
 * @retval None
 */
void ADC_SetScanMode(uint16_t u16Mode)
{
    DDL_ASSERT(IS_ADC_SCAN_MODE(u16Mode));
    MODIFY_REG16(M4_ADC->TRGSR, ADC_TRIG_SRC_MSK, u16Mode);
}

/**
 * @brief  Enable or disable ADC channel(s).
 * @param  [in]  u8Seq              The specified sequence for the channel(s) to be added in.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A:               Add channels to sequence A.
 *   @arg  ADC_SEQ_B:               Add channels to sequence B.
 * @param  [in]  u16AdcCh           The specified channel(s) to be added in the specified sequence.
 *                                  This parameter can be values of @ref ADC_Channels
 * @param  [in]  pu8SplTime         
 * @param  [in]  enNewState
 *   @arg  ADC_CH0 ~ ADC_CH9
 * @retval None.
 * @note  -(1) ADC must be stoped.
 *        -(2) Sequence A and Sequence B cannot contain the same channel.
 */
en_result_t ADC_ChannelCmd(uint8_t u8Seq, uint16_t u16AdcCh, uint8_t *pu8SplTime, en_functional_state_t enNewState)
{
    uint8_t i = 0U;
    uint8_t j = 0U;
    __IO uint16_t *ioCHSELR;
    __IO uint8_t *ioSSTR;
    en_result_t enRet = ErrorInvalidParameter;

    if (pu8SplTime != NULL)
    {
        DDL_ASSERT(IS_ADC_SEQUENCE(u8Seq));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        ioCHSELR = (__IO uint16_t *)((uint32_t)&M4_ADC->CHSELRA0);
        ioSSTR   = (__IO uint8_t *)((uint32_t)&M4_ADC->SSTR0);

        if (enNewState == Enable)
        {
            ioCHSELR[u8Seq] |= u16AdcCh;

            while (u16AdcCh)
            {
                if (u16AdcCh & (uint16_t)0x1U)
                {
                    DDL_ASSERT(IS_ADC_SPL_TIME(pu8SplTime[j]));
                    ioSSTR[i] = pu8SplTime[j++];
                }
                u16AdcCh >>= 1U;
                i++;
            }
        }
        else
        {
            ioCHSELR[u8Seq] &= (uint16_t)(~u16AdcCh);
        }

        enRet = Ok;
    }

    return enRet;

}

/**
 * @brief  
 * @param  [in]  
 * @param  [out] 
 * @retval None
 */
void ADC_AvgSetCnt(uint16_t u16AvgCnt)
{
    DDL_ASSERT(IS_ADC_AVG_CNT(u16AvgCnt));
    MODIFY_REG16(M4_ADC->CR0, ADC_CR0_AVCNT, u16AvgCnt);
}

/**
 * @brief  
 * @param  [in]  
 * @param  [out] 
 * @retval None
 */
void ADC_AvgChannelCmd(uint16_t u16AdcCh, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == Enable)
    {
        SET_REG16_BIT(M4_ADC->AVCHSELR0, u16AdcCh);
    }
    else
    {
        CLEAR_REG16_BIT(M4_ADC->AVCHSELR0, u16AdcCh);
    }
}

/**
 * @brief  ADC set extend channel source.
 * @param  [in]  u8ExChSrc          The specified source for the extend channel(channel 8).
 *                                  This parameter can be a value of @ref ADC_Extend_Channel_Source
 *   @arg  ADC_EXCH_SRC_ADC_PIN:    Select the pin P11(ADC_IN8) as the extend channel analog input source.
 *   @arg  ADC_EXCH_SRC_INTERNAL:   Select the internal analog source as the extend channel analog input source.
 * @retval None.
 * @note   ADC must be stoped.
 */
void ADC_SetExChannelSrc(uint8_t u8ExChSrc)
{
    DDL_ASSERT(IS_ADC_EXCH_SRC(u8ExChSrc));
    M4_ADC->EXCHSELR = u8ExChSrc;
}

/**
 * @brief  Set a default value for the trigger source configuration structure.
 * @param  [in]  pstcTrgCfg         Pointer to a stc_adc_trig_cfg_t structure that
 *                                  contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcTrgCfg == NULL.
 */
en_result_t ADC_TrigSrcStructInit(stc_adc_trig_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        pstcCfg->u16TrigSrc = ADC_TRIG_SRC_EVT0;
        pstcCfg->enEvent0   = EVT_AOS_STRG;
        pstcCfg->enEvent1   = EVT_AOS_STRG;

