levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_adc.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Configures trigger source for the specified sequence.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  pstcTrgCfg         Pointer to a stc_adc_trig_cfg_t structure that contains
 *                                  the configuration information of the trigger source.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcCfg == NULL.
 * @note   ADC must be stoped.
 */
en_result_t ADC_TrigSrcConfig(uint8_t u8Seq, const stc_adc_trig_cfg_t *pstcCfg)
{
    uint8_t u8Offset  = 0U;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_ADC_SEQUENCE(u8Seq));
        DDL_ASSERT(IS_ADC_TRIG_SRC(pstcCfg->u16TrigSrc));

        if (u8Seq == ADC_SEQ_B)
        {
            u8Offset = 8U;
        }

        switch (pstcCfg->u16TrigSrc)
        {
            case ADC_TRIG_SRC_EVT0:
                ADC_TRG_EVT0_REG = pstcCfg->enEvent0;
                break;

            case ADC_TRIG_SRC_EVT1:
                ADC_TRG_EVT1_REG = pstcCfg->enEvent1;
                break;

            case ADC_TRIG_SRC_EVT0_EVT1:
                ADC_TRG_EVT0_REG = pstcCfg->enEvent0;
                ADC_TRG_EVT1_REG = pstcCfg->enEvent1;
                break;

            default:
                break;
        }

        MODIFY_REG16(M4_ADC->TRGSR, \
                     (ADC_TRIG_SRC_MSK << u8Offset), \
                     (pstcCfg->u16TrigSrc << u8Offset));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or disable the trigger source of the specified sequence.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the trigger source of the specified sequence.
 *   @arg  Disable:                 Disable the trigger source of the specified sequence.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_TrigSrcCmd(uint8_t u8Seq, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_ADC_SEQUENCE(u8Seq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8Seq == ADC_SEQ_A)
    {
        bM4_ADC->TRGSR_b.TRGENA = (uint32_t)enNewState;
    }
    else
    {
        bM4_ADC->TRGSR_b.TRGENB = (uint32_t)enNewState;
    }
}

/**
 * @brief  Enable or disable the interrupt of the specified sequence.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the interrupt of the specified sequence.
 *   @arg  Disable:                 Disable the interrupt of the specified sequence.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_SeqIntCmd(uint8_t u8Seq, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_ADC_SEQUENCE(u8Seq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    BIT_BAND(M4_ADC->ICR, u8Seq) = (uint32_t)enNewState;
}

/**
 * @brief  Gets the EOC(End Of Conversion) flag.
 * @param  [in]  u8Flag         ADC EOC flag.
 *                              This parameter can be a value of @ref ADC_Eoc_Flag
 *   @arg  ADC_FLAG_EOCA
 *   @arg  ADC_FLAG_EOCB
 *   @arg  ADC_FLAG_SA_INTED
 * @retval An en_flag_status_t enumeration.
 *   @arg  Set: The specified flag has set.
 *   @arg  Reset: The specified flag has not set.
 */
en_flag_status_t ADC_SeqGetStatus(uint8_t u8Flag)
{
    return (en_flag_status_t)((M4_ADC->ISR & u8Flag) != 0U);
}

/**
 * @brief  Clear the EOC(End Of Conversion) flag.
 * @param  [in]  u8Flag             An 8bit data that containing EOCA(End Of Conversion of Sequence A)
 *                                  flag and EOCB flag. This parameter can be values of @ref ADC_Eoc_Flag
 *                                  except ADC_FLAG_SA_INTED.
 *   @arg  ADC_FLAG_EOCA
 *   @arg  ADC_FLAG_EOCB
 * @retval None
 */
void ADC_SeqClrStatus(uint8_t u8Flag)
{
    u8Flag &= ADC_EOC_FLAG_MSK;
    M4_ADC->ISCLRR |= u8Flag;
}

/**
 * @brief  
 * @param  [in]  
 * @param  [out] 
 * @retval None
 */
void ADC_SH_Config(uint16_t u16AdcCh, uint8_t u8ShCycle)
{
    uint16_t u16Temp;

    DDL_ASSERT(IS_ADC_SH_CH(u16AdcCh));
    DDL_ASSERT(IS_ADC_SH_CYCLE(u8ShCycle));

    u16Temp  = (uint16_t)(u16AdcCh << ADC_SHCR_SHSEL_POS);
    u16Temp |= (uint16_t)u8ShCycle;
    MODIFY_REG16(M4_ADC->SHCR, ADC_SH_CFG_MSK, u16Temp);
}

/**
 * @brief  
 * @param  [in]  
 * @param  [out] 
 * @retval None
 */
void ADC_ContSplCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    bM4_ADC->SHCR_b.SHMD = (uint32_t)enNewState;
}

/**
 * @brief  Starts ADC conversion of sequence A.
 * @param  [out] pu16AdcData        Pointer to the buffer the ADC data to be stored.
 * @param  [in]  u8Length           The length of the array pointed by pu16AdcData.
 * @param  [in]  u32Timeout         Timeout value(millisecond).
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pu16AdcData == NULL or u32Timeout == 0.
 *   @arg  ErrorTimeout:            ADC works timeout.
 */
en_result_t ADC_PollingSA(uint16_t *pu16AdcData, uint8_t u8Length, uint32_t u32Timeout)
{
    uint16_t    u16AdcCh;
    uint32_t    u32TimeCnt;
    en_result_t enRet = ErrorInvalidParameter;

    if ((pu16AdcData != NULL) && (u8Length != 0U) && (u32Timeout != 0U))
    {
        /* 10 is the number of required instructions cycles for the below loop statement. */
        u32TimeCnt = u32Timeout * (SystemCoreClock / 10U / 1000U);

