levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_adc.c
        ADC_Start();

        /* Polling and check timeout. */
        enRet = ErrorTimeout;
        while (u32TimeCnt--)
        {
            if (bM4_ADC->ISR_b.EOCAF != 0U)
            {
                if (u8Length < ADC_CH_CNT)
                {
                    u16AdcCh = M4_ADC->CHSELRA0;
                    ADC_GetChannelData(u16AdcCh, pu16AdcData, u8Length);
                }
                else
                {
                    ADC_GetAllData(pu16AdcData, ADC_CH_CNT);
                }
                enRet = Ok;
                break;
            }
        }

        bM4_ADC->ISCLRR_b.CLREOCAF = (uint32_t)1U;
    }

    return enRet;
}

/**
 * @brief  Get all of the ADC data.
 * @param  [out] pu16AdcData        Pointer to the buffer the ADC data to be stored.
 * @param  [in]  u8Length           The length of the array pointed by the pointer pu16AdcData.
 *                                  It must be no less than @ref ADC_Channel_Count
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pu16AdcData == NULL or u8Length < ADC_CH_CNT.
 */
en_result_t ADC_GetAllData(uint16_t *pu16AdcData, uint8_t u8Length)
{
    uint8_t  i;
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint16_t *io16AdcDr = (__IO uint16_t *)((uint32_t)&M4_ADC->DR0);

    if ((pu16AdcData != NULL) && (u8Length >= ADC_CH_CNT))
    {
        for (i = 0U; i < ADC_CH_CNT; i++)
        {
            pu16AdcData[i] = io16AdcDr[i];
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get the ADC data of the specified channel(s).
 * @param  [in]  u16AdcCh           The specified Channel(s).
 *                                  This parameter can be values of @ref ADC_Channels
 *   @arg  ADC_CH0 ~ ADC_CH11
 * @param  [out] pu16AdcData        Pointer to the buffer the ADC data to be stored.
 * @param  [in]  u8Length           The length of the array pointed by pu16AdcData.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   u16AdcCh == 0 or pu16AdcData == NULL or u8Length == 0
 */
en_result_t ADC_GetChannelData(uint16_t u16AdcCh, uint16_t *pu16AdcData, uint8_t u8Length)
{
    uint8_t i;
    uint8_t j;
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint16_t *io16AdcDr;

    if ((u16AdcCh != 0U) && (pu16AdcData != NULL) && (u8Length != 0U))
    {
        i = 0U;
        j = 0U;
        io16AdcDr = (__IO uint16_t *)((uint32_t)&M4_ADC->DR0);
        u16AdcCh &= ADC_CH_ALL;
        while (u16AdcCh && u8Length)
        {
            if (u16AdcCh & 0x1U)
            {
                pu16AdcData[j++] = io16AdcDr[i];
                u8Length--;
            }

            u16AdcCh >>= 1U;
            i++;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get the ADC value of the specified ADC pin.
 * @param  [in]  u8AdcPin           The ADC pin number.
 *                                  This parameter can be a value of @ref ADC_Pin_Number
 * @retval An uint16_t value -- the ADC value of the specified ADC pin.
 */
uint16_t ADC_GetValue(uint8_t u8AdcPin)
{
    uint16_t u16Ret = (uint16_t)0xFFFF;
    __IO uint16_t *io16AdcDr = (__IO uint16_t *)((uint32_t)&M4_ADC->DR0);

    if (u8AdcPin <= ADC_PIN_NUM_MAX)
    {
        u16Ret = io16AdcDr[u8AdcPin];
    }

    return u16Ret;
}

/**
 * @}
 */

#endif /* DDL_ADC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
